{
  "_name_or_path": "xlm-roberta-base",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Actes judiciaires",
    "1": "Fonds de Commerce",
    "2": "Convocations",
    "3": "Avis aux cr\u00e9anciers",
    "4": "Gestion de Soci\u00e9t\u00e9s",
    "5": "Associations, Partis, Syndicats et Syndics",
    "6": "Divers"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Actes judiciaires": 0,
    "Associations, Partis, Syndicats et Syndics": 5,
    "Avis aux cr\u00e9anciers": 3,
    "Convocations": 2,
    "Divers": 6,
    "Fonds de Commerce": 1,
    "Gestion de Soci\u00e9t\u00e9s": 4
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
